#1. Создайте список, содержащий разные типы данных
new_list = [1, 2, 3, 228, 'Hello Vlad!', 3.14, 'Georgia']

#2. Создайте список, вырежьте из него элементы с 1 по 3, поместите их в новый список и распечатайте
new_list = [34, 777, 98, 3, 228, 'Hello Vlad!', 3.14, 'Georgia']
another_list = new_list[:3]
print(another_list)