#1. Создайте множество при помощи функции set() из текста, чтобы получить уникальные символы, содержащиеся в тексте.
#Присвойте результат переменной. Выведите переменную на экран. Выведите тип значения переменной на экран.
#При необходимости найдите информацию в интернете

text = 'Hello! I am Tsadzikidze Arsen and I am studying Python right now'
set_from_text = set(text)
print(set_from_text)
print(type(set_from_text))