#1.Создайте объект tuple, описывающий компьютер и распакуйте его в
#соответствующие переменные. Выведите переменные вызвав функцию print() один раз

tuple = ('HP Pavilion Gaming', 15.6, '512gb', 'NVIDIA GeForce GTX 1650Ti', 'AMD Ryzen 5 4600H', '16gb')
name, screen, SSD, Video_processor, Motherboard, RAM_size = tuple
print(name, screen, SSD, Video_processor, Motherboard, RAM_size)