# 1. Создайте 2 переменных, содержащие числовые значения. 
# Сравните их при помощи всех операторов сравнения и выведите результат на экран
first_num = 101
second_num = 105
print(first_num > second_num)
print(first_num < second_num)
print(first_num == second_num)
print(first_num != second_num)

# 2. Сравните две одинаковых буквы, но одна из них должна быть заглавной, 
# при помощи операторов сравнения ">" и выведите результат на экран.
# Выведите на экран ASCII код каждой из букв
letter_1 = 'A'
letter_2 = 'a'
print(letter_1 > letter_2)
print(ord('A'))
print(ord('a'))